Autodesk.Revit.DB.FamilyPointLocation.GetLocation
Gets the location of the point.
Returns:
The location of the point.
Since:
2017

Autodesk.Revit.DB.FamilyPointLocation.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FamilyPointLocation.Name
The name of the corresponding reference point in the Family document.

Autodesk.Revit.DB.FamilyPointLocation
Data corresponding to the point locations in certain types of Family Symbols.
Remarks:
Examples of FamilySymbol objects that contain placement references are Panels and Flexible Components.